---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FloorParamSpanDirection
source: html/0a486c45-b571-e8ce-e2a6-c2c95465acf4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FloorParamSpanDirection Property

"Span Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId FloorParamSpanDirection { get; }
```